In [3]:
print("Introduction to pandas")

Introduction to pandas

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

# DATA STRUCTURES
* Series (1 d)
* DataFrame (2 d)

In [5]:
import pandas as pd

SERIES

In [6]:
S=pd.Series([1,3,5,7,9]) # series is a labelled array..

In [7]:
S

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [8]:
s = pd.Series([1,3,5,7,9], index=['a','b','c','d','e'])
print(s)

a    1
b    3
c    5
d    7
e    9
dtype: int64

DATAFRAME

In [9]:
df = pd.DataFrame({"names": ['Alice', 'Bob', 'Charlie'],"marks": [85, 90, 95]})

In [10]:
df

     names  marks
0    Alice     85
1      Bob     90
2  Charlie     95

# Read a CSV File

In [11]:
df=pd.read_csv("StudentsPerformance.csv")

In [12]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [ ]:
df.head() # shows first 5 rows of the dataframe

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [14]:
df.tail() # shows last 5 rows of the dataframe

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [15]:
df.describe() # shows statistical summary of numerical columns

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

# DATA SELECTION

In [ ]:
type(df["gender"]) # to check the datatype of a particular column

pandas.core.series.Series

In [18]:
df[["gender","math score"]] # to select multiple columns

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [ ]:
df.iloc[0] # to select first row

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: 0, dtype: object

In [20]:
type(df.iloc[0])

pandas.core.series.Series

In [21]:
df.rename(columns={"math score":"Maths Score"}) # to rename a column

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Maths Score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [25]:
df["test preparation course"] = df["test preparation course"].map({
    "none": 0,
    "completed": 1
})
 # to change datatype of a column

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   int64
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(4), object(4)
memory usage: 62.6+ KB

In [ ]:
len(df) # to get number of rows in dataframe

1000

In [28]:
df["zeros"] = [0 for i in range(len(df))] # to add a new column with default values

In [29]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,zeros
0,female,group B,bachelor's degree,standard,0,72,72,74,0
1,female,group C,some college,standard,1,69,90,88,0
2,female,group B,master's degree,standard,0,90,95,93,0
3,male,group A,associate's degree,free/reduced,0,47,57,44,0
4,male,group C,some college,standard,0,76,78,75,0
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,1,88,99,95,0
996,male,group C,high school,free/reduced,0,62,55,55,0
997,female,group C,high school,free/reduced,1,59,71,65,0
998,female,group D,some college,standard,1,68,78,77,0
999,female,group D,some college,free/reduced,0,77,86,86,0

# Concat datasets

In [30]:
df1=pd.DataFrame({
    "name":["SG","SS","SK"],
    "marks":[90,34,89],
})

In [31]:
df1

  name  marks
0   SG     90
1   SS     34
2   SK     89

In [32]:
df2=pd.DataFrame({
    "name":["PM","SM","TM"],
    "marks":[85,89,91],
})

In [33]:
df2

  name  marks
0   PM     85
1   SM     89
2   TM     91

In [34]:
pd.concat([df1,df2])

  name  marks
0   SG     90
1   SS     34
2   SK     89
0   PM     85
1   SM     89
2   TM     91

# Merge

In [35]:
df1=pd.DataFrame({
    "name":["SG","SS","SK"],
    "marks":[90,34,89],
})

In [36]:
df2=pd.DataFrame({
    "name":["SG","SS","SK"],
    "roll":[1,2,3],
})

In [37]:
pd.merge(df1,df2,on="name")

  name  marks  roll
0   SG     90     1
1   SS     34     2
2   SK     89     3